Repository: AleksAletin/shopvpn
Catalog: app/locales/*/LC_MESSAGES/bot.po
Languages: ru

source: 🛠 Admin tools
ru: 🛠 Административные инструменты

source: 📊 Statistics
ru: 📊 Статистика

source: 👤 Editor users
ru: 👤 Редактор пользователей

source: 🎟️ Editor promocodes
ru: 🎟️ Редактор промокодов

source: 📢 Send notification
ru: 📢 Отправить уведомление

source: 💾 Create backup
ru: 💾 Создать бэкап

source: 🔄 Restart bot
ru: 🔄 Перезапустить бота

source: Create
ru: Создать

source: Delete
ru: Удалить

source: Edit
ru: Изменить

source: GB
ru: ГБ

source: 1 day
ru: 1 день

source: ◀️ Back
ru: ◀️ Назад

source: ◀️ Back to main menu
ru: ◀️ Назад в главное меню

source: Download
ru: 📥 Скачать

source: Connect
ru: 🔌 Подключить

source: 👤 Profile
ru: 👤 Профиль

source: 💳 Subscription
ru: 💳 Подписка

source: 👥 Referral Program
ru: 👥 Пригласить

source: 🆘 Support
ru: 🆘 Помощь

source: 💸 Pay
ru: 💸 Оплатить

source: YooKassa | {price} ₽
ru: ЮKassa | {price} ₽

source: 📥 Download app
ru: 📥 Скачать приложение

source: 💳 Buy subscription
ru: 💳 Купить подписку

source: 🔑 Show key
ru: 🔑 Показать ключ

source: 💳 Renew subscription
ru: 💳 Продлить подписку

source: 🎟️ Activate promocode
ru: 🎟️ Активировать промокод

source: 👨‍💻 Contact the operator
ru: 👨‍💻 Связаться с оператором

source: ❓ How to connect
ru: ❓ Как подключиться

source: ❓ VPN not working
ru: ❓ VPN не работает

source: Subscription | traffic: {traffic}, duration: {duration}
ru: Подписка | трафик: {traffic}, длительность: {duration}

source: traffic: {traffic}, duration: {duration}
ru: трафик: {traffic}, длительность: {duration}

source: 🛠 *Admin tools:*
ru: 🛠 *Административные инструменты:*

source: 🎟️ *Editor promocodes:*
ru: 🎟️ *Редактор промокодов:*

source: 🎟️ *Editor promocodes:* _Select the traffic volume_
ru: 🎟️ *Редактор промокодов:* _Выберите объем трафика_

source: 🎟️ *Editor promocodes:* _Specify the duration_
ru: 🎟️ *Редактор промокодов:* _Укажите срок действия_

source: 🎟️ *Editor promocodes:*
ru: 🎟️ *Редактор промокодов:*

source: Your created promocode: ```{promocode}```
ru: Ваш созданный промокод: ```{promocode}```

source: 🎟️ *Editor promocodes:* _Send promocode to delete_
ru: 🎟️ *Редактор промокодов:* _Отправьте промокод для удаления_

source: ✅ Promocode {promocode} deleted successfully.
ru: ✅ Промокод {promocode} успешно удален.

source: ❌ Failed to delete promocode. Please try again.
ru: ❌ Не удалось удалить промокод. Пожалуйста, попробуйте еще раз.

source: 📲 *Choose your platform:*
ru: 📲 *Выберите вашу платформу:*

source: To connect, you need to install the app and enter your key manually or click the `🔌 Connect` button.
ru: Чтобы подключиться, вам необходимо установить приложение и ввести свой ключ вручную илнажать кнопку `🔌 Подключить`

source: Welcome, {name}! 🎉 3X-UI SHOP — your reliable assistant in the world of free internet. We offer safe and fast connections to any internet services using the XRAY protocol. Our service works even in China, Iran, and Russia. 🚀 HIGH SPEED 🔒 SECURITY 📱 SUPPORT FOR ALL PLATFORMS ♾️ UNLIMITED ✅ GUARANTEE AND TRIAL PERIOD
ru: Добро пожаловать, {name}! 🎉 3X-UI SHOP — ваш надежный помощник в мире свободного интернета. Мы предлагаем безопасное и быстрое подключение к любым интернет-сервисам с использованием протокола XRAY. Наш сервис работает даже в Китае, Иране и России. 🚀 ВЫСОКАЯ СКОРОСТЬ 🔒 БЕЗОПАСНОСТЬ 📱 ПОДДЕРЖКА ВСЕХ ПЛАТФОРМ ♾️ БЕЗЛИМИТ ✅ ГАРАНТИЯ И ПРОБНЫЙ ПЕРИОД

source: ✅ *You selected:* Plan: {plan} Duration: {duration} Price: {price} {currency} _After payment, a unique key will be generated for you, to connect to the VPN. The key will be available in your profile._
ru: 💸 *Вы выбрали:* Тариф: {plan} Длительность: {duration} Стоимость: {price} {currency} _После оплаты для вас сгенерируется уникальный ключ, для подключения к VPN. Ключ будет доступен в вашем профиле._

source: ✅ *Payment successful!* 🔑 *Your key:* ```{key}``` _The key will be saved in your profile._ To start using our service, go to the download page of the application and download it for your platform. Then you can manually enter the key or click `🔌 Connect` and the key will be automatically added to the application.
ru: ✅ *Платеж прошел успешно!* 🔑 *Ваш ключ:* ```{key}``` _Ключ будет сохранен в вашем профиле._ Чтобы начать пользоваться нашим сервисом, перейдите на страницу загрузки приложения и загрузите его для своей платформы. Затем вы можете вручную ввести ключ или нажать "🔌 Подключить", и ключ будет автоматически добавлен.

source: 👤 *Your profile:* Name: {name} ID: {id}
ru: 👤 *Ваш профиль*: Имя: {name} ID: {id}

source: _You don't have a subscription purchased yet, go to the subscription page to purchase or click the button below._
ru: _У вас еще не было приобретенной подписки, перейдите на страницу подписки для покупки или нажмите кнопку ниже._

source: 📅 *Subscription:* Plan: {plan}
ru: 📅 *Подписка*: Тариф: {plan}

source: _Traffic limit reached._
ru: _Достигнут лимит трафика._

source: Expires on: {expiry_time}
ru: Заканчивается через: {expiry_time}

source: Remaining Traffic: {traffic}
ru: Осталось: {traffic}

source: _Subscription period has expired._
ru: _Время подписки истекло._

source: Remaining Traffic: {traffic} Expires on: {expiry_time}
ru: Осталось: {traffic} Заканчивается через: {expiry_time}

source: 📊 *Statistics:* Total: {total} Sent: ↑ {up} Received: ↓ {down}
ru: 📊 *Статистика:* Всего: {total} Отправлено: ↑ {up} Получено: ↓ {down}

source: 🔑 *Your key:* (Closes after {seconds_text}) ```{key}```
ru: 🔑 *Ваш ключ:* (Скроется через {seconds_text}) ```{key}```

source: 6 seconds
ru: 6 секунд

source: 1 second
ru: 1 секунда

source: 🎟️ *Activate promocode:* _Send promocode to activation_
ru: 🎟️ *Активировация промокода:* _Отправьте промокод для активации_

source: ✅ Promocode {promocode} was successfully activated!
ru: ✅ Промокод {promocode} успешно активирован!

source: ✅ Promocode {promocode} was successfully activated! _You have received {traffic} and {duration}._
ru: ✅ Промокод {promocode} успешно активирован! _Вы получили {traffic} и {duration}._

source: ❌ Promocode is invalid or has already been activated!
ru: ❌ Промокод недействителен или уже был активирован!

source: ⚠️ *Your subscription period and traffic have expired!*
ru: ⚠️ *Срок вашей подписки и трафик истек!*

source: ⚠️ *Traffic limit reached!*
ru: ⚠️ *Достигнут лимит трафика!*

source: ⚠️ *Subscription period has expired!*
ru: ⚠️ *Срок вашей подписки истек!*

source: Please renew your subscription to continue using our service.
ru: Пожалуйста, возобновите подписку, чтобы продолжить пользоваться нашим сервисом.

source: ✅ *You already have an active subscription:* Plan: {plan} Remaining Traffic: {traffic} Expires on: {expiry_time}
ru: ✅ *У вас уже есть активная подписка:* Тариф: {plan} Осталось: {traffic} Заканчивается через: {expiry_time}

source: ⚠️ *You do not have an active subscription!* It seems that you haven't purchased a subscription yet. Please buy a subscription to start using our service.
ru: ⚠️ *У вас нет активной подписки!* Похоже, что вы еще не приобрели подписку. Пожалуйста, купите подписку, чтобы начать пользоваться нашим сервисом.

source: 🌐 *Select the traffic volume:*
ru: 🌐 *Выберите объем трафика:*

source: ⏳ *Specify the duration:*
ru: ⏳ *Укажите срок действия:*

source: 💳 *Choose a payment method:*
ru: 💳 *Выберите способ оплаты:*

source: 🆘 *Support:* For collaboration, improvements to functionality, and any other inquiries, please contact the operator.
ru: 🆘 *Помощь:* По вопросам сотрудничества, улучшения функциональности и любым другим вопросам, пожалуйста, обращайтесь к оператору.

source: ℹ️ *How to connect:* After subscribing, you will be given an access key that you can use to connect to our VPN. If you have a key, go to the application download page and connect the key.
ru: ℹ️ *Как подключиться:* После оформления подписки вам будет предоставлен ключ доступа, который вы сможете использовать для подключения к нашему VPN. Если у вас уже есть ключ, перейдите на страницу загрузки приложения и подключите ключ.

source: ℹ️ *VPN not working:* There could be several reasons why VPN is not working. Please check the following: - Ensure your internet connection is stable. - Make sure your subscription is active. - Try reconnecting or restarting the app. If the issue persists, please contact support.
ru: ℹ️ *VPN не работает:* Может быть несколько причин, по которым VPN не работает. Пожалуйста, проверьте следующее: - Убедитесь, что ваше интернет-соединение стабильно. - Убедитесь, что ваша подписка активна. - Попробуйте переподключиться или перезапустить приложение. Если проблема сохраняется, свяжитесь с оператором поддержки.

source: MB
ru: МБ

source: TB
ru: ТБ

source: PB
ru: ПБ

source: EB
ru: ЭБ

source: ZB
ru: ЗБ

source: YB
ru: ЙБ

source: d
ru: д

source: h
ru: ч

source: m
ru: м

source: 1 year
ru: 1 год

source: 1 month
ru: 1 месяц
